In [20]:
import pandas as pd
from sqlalchemy import create_engine
import numpy as np
import os
import pygal
import matplotlib.pyplot as plt
import sqlalchemy
from datetime import datetime,date,time,timedelta
import calendar
import math
from os import remove

In [25]:
ruta='/Users/Laura/Desktop/COTRAPSA/Analisis facturas/Facturas con mano de obra/tratadas'

In [26]:
lst_arch = ([x for x in os.listdir(ruta) if x[-4:]=='xlsx'])
lst_arch

['Facturas_Bimbo.xlsx', 'Facturas_Barcel.xlsx', 'Facturas_Alpura.xlsx']

In [27]:
lst_df = []
for arch in lst_arch:
    df = pd.read_excel(os.path.join(ruta,arch),encoding='iso-8859-1')
    lst_df.append(df)

In [42]:
lst_df[0].head()

,Nombre,Fecha_elab,Fecha_entr,Fecha_p,Subtotal,Importe_total,Método_pago
0,"BIMBO, S.A. DE C",201611,201611,201612,42642.0,49464.72,3
1,"BIMBO, S.A. DE C",201702,201702,201703,23616.0,27394.56,3
2,"BIMBO, S.A. DE C",201611,201611,201612,1696.0,1967.36,3
3,"BIMBO, S.A. DE C",201611,201611,201612,24204.0,28076.64,3
4,"BIMBO, S.A. DE C",201611,201611,201612,2700.0,3132.00,3

In [46]:
lst_df[1].head()

,Nombre,Fecha_elab,Fecha_entrega,Fecha_pago,Subtotal,Importe_total,Método_pago
0,BARCEL S.A. DE C,201908,201907,201909,7011,8132.76,PPD
1,BARCEL S.A. DE C,201907,201906,201907,46174,53561.84,PPD
2,BARCEL S.A. DE C,201907,201906,201907,44896,52079.36,PPD
3,BARCEL S.A. DE C,201907,201906,201907,45974,53329.84,PPD
4,BARCEL S.A. DE C,201907,201906,201907,46255,53655.80,PPD

In [49]:
lst_df[2].head()

,Nombre,Fecha_elabo,Fecha_entr,Fecha_pago,Subtotal,Importe_total,Método_pago
0,TRANSPORTADO,201702,201702,201703,23388.75,27130.95,3
1,TRANSPORTADO,201709,201709,201711,34817.28,40388.05,03 TRANSFERENCIA ELECTRÓNIC
2,TRANSPORTADO,201803,201803,201804,25202.00,29234.32,PPD
3,TRANSPORTADO,201810,201810,201811,25202.00,29234.32,PPD
4,TRANSPORTADO,201802,201802,201804,25202.00,29234.32,PPD

In [52]:
aux=lst_df[0][['Fecha_p','Importe_total']].groupby('Fecha_p').sum()
aux.sort_values('Fecha_p',ascending=True,inplace=True)
aux

         Importe_total
Fecha_p
201610         4479.92
201611        42661.32
201612       229478.16
201701       508638.28
201702       187603.32
201703        97240.48
201704       165192.12
201705        37403.04
201706        62296.64
201707        41823.80
201708       109811.40
201709       286748.52
201710        99768.90
201711       147898.20
201712       133583.28
201801        23718.52
201802       156091.92
201803        28134.64
201804        96655.84
201805       164780.32
201806       176062.48
201807       122433.36
201808        39696.36
201809       142547.76
201810        74815.36
201811       110459.84
201812        51831.12
201901        84188.16
201902       100182.24
201903         7134.00
201904        88593.84
201905       496254.96
201906       396852.24
201907       271322.84
201908       246553.36
201909        49625.96

In [53]:
aux2=lst_df[1][['Fecha_pago','Importe_total']].groupby('Fecha_pago').sum()
aux2.sort_values('Fecha_pago',ascending=True,inplace=True)
aux2

            Importe_total
Fecha_pago
201803          103009.16
201804           32818.72
201807            3120.40
201808          129868.96
201810           76272.32
201811           61299.04
201812          117531.20
201902          270825.20
201903          358747.40
201904          290261.00
201905          390415.40
201906          444186.04
201907          653921.00
201908          261284.20
201909          526817.48

In [54]:
aux3=lst_df[2][['Fecha_pago','Importe_total']].groupby('Fecha_pago').sum()
aux3.sort_values('Fecha_pago',ascending=True,inplace=True)
aux3

            Importe_total
Fecha_pago
201703           27130.95
201711           40388.05
201804          204640.24
201805          146171.60
201806           29234.32
201807           29234.32
201811          146171.60
201908           36040.04
201909          108120.12

In [56]:
df2=pd.read_excel('/Users/Laura/Desktop/COTRAPSA/Analisis facturas/Facturas_Cotrapsa_2.xlsx')

In [57]:
df2 = df2[df2.Estatus=='Emitida']
df2.reset_index(inplace=True,drop=True)

In [75]:
aux4=df2[['Fecha_de_p','Importe']].groupby('Fecha_de_p').sum()
aux4.sort_values('Fecha_de_p',ascending=True,inplace=True)

In [60]:
line_chart = pygal.Bar()
line_chart.title = 'Facturas'
line_chart.x_labels = aux4.index
line_chart.add('Bimbo',aux.Importe_total)
line_chart.add('Barcel',aux2.Importe_total)
line_chart.add('Alpura',aux3.Importe_total)
line_chart.add('Facturas sin mano obra',aux4.Importe)
line_chart.render_to_file('Facturas.svg')

In [ ]:
line_chart = pygal.Bar()
line_chart.title = 'Facturas con mano de obra'
line_chart.x_labels = aux.index
line_chart.add('Bimbo',aux.Importe_total)
line_chart.add('Barcel',aux2.Importe_total)
line_chart.add('Alpura',aux3.Importe_total)
line_chart.render_to_file('Facturas_mano_obra.svg')

In [74]:
line_chart = pygal.Bar()
line_chart.title = 'Facturas'
line_chart.x_labels = aux.index
line_chart.add('Bimbo',aux.Importe_total)
line_chart.add('Barcel',aux2.Importe_total)
line_chart.add('Alpura',aux3.Importe_total)
line_chart.add('Facturas sin mano obra',aux4.Importe)
line_chart.render_to_file('Facturas_2019.svg')